---
kind: method
id: M:Autodesk.Revit.DB.Analysis.AnalysisDisplayDeformedShapeSettings.Dispose
source: html/10300ea9-4837-87ea-c96f-ab8e871a2020.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayDeformedShapeSettings.Dispose Method

Releases all resources used by the AnalysisDisplayDeformedShapeSettings

## Syntax (C#)
```csharp
public void Dispose()
```